# Цей файл зберігає ВСІ глобальні змінні, щоб уникнути циклів

import psutil
import logging
from collections import deque

logger = logging.getLogger(__name__)
process = psutil.Process()

# Глобальні змінні стану
maintenance_mode = False
active_users = set()
rooms = {} 
user_message_times = {} 
matchmaking_queue = [] # (user_id, username, timestamp)
maintenance_timer_task = None 
DB_PATH = 'players.db'

# Константи
LOCATIONS = [
    "Аеропорт", "Банк", "Пляж", "Казино", "Цирк", "Школа", "Лікарня",
    "Готель", "Музей", "Ресторан", "Театр", "Парк", "Космічна станція",
    "Підвал", "Океан", "Острів", "Кафе", "Аквапарк", "Магазин", "Аптека",
    "Зоопарк", "Місяць", "Річка", "Озеро", "Море", "Ліс", "Храм",
    "Поле", "Село", "Місто", "Ракета", "Атомна станція", "Ферма",
    "Водопад", "Спа салон", "Квартира", "Метро", "Каналізація", "Порт"
]
CALLSIGNS = [
    "Бобр Курва", "Кличко", "Фенікс", "Шашлик", "Мамкін хакер", "Сігма", "Деві Джонс", "Курт Кобейн",
    "Шрек", "Тигр", "Тарас", "Він Дізель", "Дикий борщ", "Раян Гослінг", "Том Круз", "Лео Ді Капрізник",
    "Місцевий свата", "Банан4ік", "Мегагей", "Туалетний Філософ", "Свій Шпигун", "Не Шпигун", "Санечка",
    "Скала", "Захар Кокос", "Козак", "Чорний", "Аня 15см", "Анімешнік", "Джамал", "Ловець Натуралів",
    "Натурал", "Санс", "Гетеросексуал", "Рікрол", "Сапорт", "Туалетний Монстр", "456", "Скажений Пельмень"
]
last_save_time = 0
SAVE_INTERVAL = 5
ROOM_EXPIRY = 3600 
XP_CIVILIAN_WIN = 10
XP_SPY_WIN = 20